// 职业病因素—测试数据
const occupationDiseaseData = [
  {
    type: 'occupation_disease',
    place: '高压配电室和配件库', // 位置
    occupationDiseaseType: '工频电厂', // 职业病类型
    id: 'zybl-2023-02-01',
    area: {
      color: '#2daff960',
      height: 0,
      floorId: 1,
      strokeColor: '#000',
      stretchHeight: 15,
      position: [
        { x: 111.3931912022042, y: 30.65766163919534, z: 0 },
        { x: 111.39339419013938, y: 30.657607265601097, z: 0 },
        { x: 111.39329913317728, y: 30.65733479032235, z: 0 },
        { x: 111.39309368006413, y: 30.65738948223749, z: 0 },
        { x: 111.39309358291676, y: 30.657389499014386, z: 0 },
        { x: 111.3931912022042, y: 30.65766163919534, z: 0 },
      ],
    },
  },
  {
    type: 'occupation_disease',
    place: '化学品库',
    occupationDiseaseType: '氢氧化钠溶液、盐酸、硫酸、油墨、酒精',
    id: '0acd39b62da0b44402615597d03b799e-01',
    area: {
      color: '#2daff960',
      height: 0,
      floorId: 1,
      strokeColor: '#000',
      stretchHeight: 13,
      position: [
        { x: 111.39736047502952, y: 30.652574715981668, z: 0 },
        { x: 111.39760896780794, y: 30.652500861561492, z: 0 },
        { x: 111.39755104580694, y: 30.652357942477735, z: 0 },
        { x: 111.39730059346957, y: 30.652431878529143, z: 0 },
        { x: 111.39730059346957, y: 30.652431878529143, z: 0 },
        { x: 111.39736047502952, y: 30.652574715981668, z: 0 },
      ],
    },
  },
  {
    type: 'occupation_disease',
    place: '废水收集池',
    occupationDiseaseType: '二氧化硫、碳氧化物',
    id: 'zybl-2023-02-03',
    area: {
      color: '#2daff960',
      height: 0,
      floorId: 1,
      strokeColor: '#000',
      stretchHeight: 20,
      position: [
        { x: 111.39365593599489, y: 30.653958444342663, z: 0 },
        { x: 111.3948201243821, y: 30.653644027904107, z: 0 },
        { x: 111.39487518340994, y: 30.653551661053402, z: 0 },
        { x: 111.39471779510352, y: 30.653130415242615, z: 0 },
        { x: 111.39348015120454, y: 30.653473556443195, z: 0 },
        { x: 111.39348005406136, y: 30.653473573218427, z: 0 },
        { x: 111.39365593599489, y: 30.653958444342663, z: 0 },
      ],
    },
  },
  {
    type: 'occupation_disease',
    id: '03fdfa4ae79e03633023bdadc8941399-02',
    place: '食品原料一车间',
    occupationDiseaseType: '粉尘、噪音',
    area: {
      color: '#ffbf0160',
      height: 0,
      floorId: 1,
      strokeColor: '#000',
      stretchHeight: 22,
      position: [
        { x: 111.39685181143471, y: 30.655438540478052, z: 0 },
        { x: 111.3977085324254, y: 30.655201856828512, z: 0 },
        { x: 111.39809008390748, y: 30.656342425562965, z: 0 },
        { x: 111.39722876033925, y: 30.656569109886604, z: 0 },
        { x: 111.39724221310698, y: 30.656558712424165, z: 0 },
        { x: 111.39685181143471, y: 30.655438540478052, z: 0 },
      ],
    },
  },
]

export default occupationDiseaseData
