// 视图位置-   view2d_top 顶视图： "rotate":360,"tilt":360
const viewerOptions = [
  {
    id: 'view2d_top',
    name: '园区地图总览',
    // center: { center: { x: 111.3945177540952, y: 30.655763565325856, z: 5.07477594854937 }, distance: 1425, rotate: 360, tilt: 360 }
    // center:{"center":{"x":111.39621680924779,"y":30.65576589438068,"z":23.360926446923944},"distance":1284,"rotate":360,"tilt":360},
    center: {
      center: {
        x: 109.721489848738,
        y: 36.6995145572977,
        z: 10.360926446923944,
      },
      distance: 501.8,
      rotate: 209.0,
      tilt: 34.0,
    },
  },
  {
    id: 'view3d',
    name: '园区工厂鸟瞰',
    // center: { center: { x: 111.39625458355968, y: 30.657164155272742, z: 4.637229619312512 }, distance: 421.8, rotate: 209.0, tilt: 34.0 }
    center: {
      center: {
        x: 109.7209133728,
        y: 36.6993940150973,
        z: 4.637229619312512,
      },
      distance: 1084,
      rotate: 360,
      tilt: 360,
    },
  },
  // {
  //   id: 'view3d_01',
  //   name: '综合楼入口处',
  //   center: {
  //     center: { x: 111.39693395150542, y: 30.65800926902815, z: 5.317573218728591 },
  //     distance: 118.72394580214389,
  //     rotate: 210.75042825391526,
  //     tilt: 44.58584059522741
  //   }
  // },
  /*         {
          id:'view3d_02',name:'综合楼制剂车间',
          center:{"center":{"x":111.3973113635352,"y":30.658224199804163,"z":19.069967128891488},"distance":91.95712500907513,"rotate":218.89960715231626,"tilt":31.06513164547801}
      }, */
  // {
  //   id: 'view3d_03',
  //   name: '细胞营养健康食品车间',
  //   center: {
  //     center: { x: 111.39715950027627, y: 30.657590306499714, z: 30.68067647150872 },
  //     distance: 121.49107835580686,
  //     rotate: 212.38492942382555,
  //     tilt: 35.79686118178182
  //   }
  // }
]

export default viewerOptions
