// 作业票状态
const ticketStatusList = [
  {
    label: '申请中',
    value: 0,
  },
  {
    label: '审批告知配置中',
    value: 1,
  },
  {
    label: '审批中',
    value: 2,
  },
  {
    label: '作业中',
    value: 3,
  },
  {
    label: '暂停作业',
    value: 4,
  },
  {
    label: '完成作业',
    value: 5,
  },
  {
    label: '已验收',
    value: 6,
  },
]

// 作业票类型
const ticketTypeList = [
  { label: '动火作业', value: '1001' },
  { label: '受限空间作业', value: '1002' },
  { label: '登高作业', value: '1003' },
  { label: '临时用电作业', value: '1004' },
  // { label: '断路作业', value: '1005' },
  { label: '动土作业', value: '1006' },
  { label: '吊装作业', value: '1007' },
  { label: '盲板抽堵作业', value: '1008' },
]

// 未使用
const safeOperationData = [
  {
    type: 'fire_operate',
    id: 'swjm-2023-02-01',
    applyUnitName: '生产部', // 申请单位
    applyUserName: '张宏', // 申请人
    code: 'swjm-2023-02-01', // 作业编号
    state: '作业中', // 状态
    time: '2023-02-01 12:20', // 时间
    operate_type: '动火作业', // 作业类型
    content: '焊接', // 作业类型
    place: '调味品生产线', // 作业位置
    // 电子围栏
    positions: [
      { x: 111.39355210036351, y: 30.6534913917793, z: 6 },
      { x: 111.39476535210333, y: 30.653157747996282, z: 6 },
      { x: 111.39492889000077, y: 30.653628088904323, z: 6 },
      { x: 111.39370879945324, y: 30.6539671416468, z: 6 },
      { x: 111.39370870230972, y: 30.65396715842245, z: 6 },
      { x: 111.39355210036351, y: 30.6534913917793, z: 6 },
    ],
    bindCards: ['BA3F6219', 'BA3F6220'], // 绑定人员卡号
  },
  {
    type: 'general_operate',
    id: 'swjm-2023-02-02',
    applyUnitName: '销售部',
    applyUserName: '王蒙',
    code: 'swjm-2023-02-02',
    state: '作业完成',
    time: '2023-02-02 15:20',
    operate_type: '一般作业',
    content: '维护设备',
    place: '鸡精生产车间',
    state: '作业中',
    // 电子围栏
    positions: [
      { x: 111.39331825005493, y: 30.653555071289105, z: 6.5 },
      { x: 111.39346550018102, y: 30.653952626400493, z: 6.5 },
      { x: 111.39307002676438, y: 30.65405807448694, z: 6.5 },
      { x: 111.39296472742545, y: 30.6537414796081, z: 6.5 },
      { x: 111.39297522771818, y: 30.65369569046437, z: 6.5 },
      { x: 111.39301290885139, y: 30.65366065083601, z: 6.5 },
      { x: 111.39310008333293, y: 30.653608584066216, z: 6.5 },
      { x: 111.39309998618937, y: 30.65360860084125, z: 6.5 },
      { x: 111.39331825005493, y: 30.653555071289105, z: 6.5 },
    ],
    bindCards: ['1AE6EB7F', '1AE6EB7D'],
  },
]

export {
  safeOperationData,
  ticketStatusList,
  ticketTypeList,
}
