export const TargetConfigList = [
  {
    code: 1,
    name: '轻微伤事故(安全目标超标0人次)',
    type: 0,
  },
  {
    code: 2,
    name: '轻伤事故(安全目标超标0人次)',
    type: 0,
  },
  {
    code: 3,
    name: '重伤事故(安全目标0人次)',
    type: 0,
  },
  {
    code: 4,
    name: '死亡事故(安全目标0人次)',
    type: 0,
  },
  {
    code: 5,
    name: '发生职业病数量(安全目标0次)',
    type: 0,
  },
  {
    code: 6,
    name: '严格执行安全事故报告制度，发生安全事故后应保护现场，迅速组织抢救，并及时上报部门安全主管，不得隐瞒不报、谎报或拖延不报。安全事故按"四不放过"原则严肃调查处理，并在限期内召开工段安全会议，填写相关会议纪要',
    type: 0,
  },
  {
    code: 7,
    name: '事故隐患整改达到100%',
    type: 0,
  },
  {
    code: 8,
    name: '安全隐患整改率达到100%。本工段所辖范用内的安全隐患工段长是第一责任人，负责日常排查、信息收集工作；发现隐患后整改方案确定、整改实施、效果跟踪，由工段长负责监督执行情况，并将整改结果在限定的整改期限内以邮件形式反馈给部门安全主管',
    type: 0,
  },
  {
    code: 9,
    name: '安全事故"四不放过"原则执行情况',
    type: 0,
  },
  {
    code: 10,
    name: '日、周、月度、季度及节前安全检查执行及信息反馈情况',
    type: 0,
  },
  {
    code: 11,
    name: '安全工作完成率100%',
    type: 0,
  },
  {
    code: 12,
    name: '工段内开展工艺、设备、工程、技术等方面的新增、改进工作时，参与"四新"的安全性评价和危险源辨识工作。严格履行"四新"项目交付流程，负责制定相应管理制度措施，在项目负责人协助下做好员工操作、安全培训工作，并将相关交付资料、培训记录整理归档。项目交付后，对使用过程中发现的安全隐患会同项目负责人及时改进，不留事故隐患，并报告安全主管',
    type: 0,
  },
  {
    code: 13,
    name: '三级安全教育达到100%',
    type: 0,
  },
  {
    code: 14,
    name: '消防安全培训达到100%，且年度消防安全培训课时≥2hr/人',
    type: 0,
  },
  {
    code: 15,
    name: '职业健康培训达到100%',
    type: 0,
  },
  {
    code: 16,
    name: '全员日常安全环保技术培训，培训时长≥2hr/人',
    type: 0,
  },
  {
    code: 17,
    name: '特种作作业人员持证上岗率达100%',
    type: 0,
  },
  {
    code: 18,
    name: '安全应急演练人均不少于2次',
    type: 0,
  },
  {
    code: 19,
    name: '负责本工段级安全培训材料、考查试卷的编写，并确保每年更新一次;新员工到工段后三天内完成工段级安全培训，工段级考查试卷归档并填写《三级安全教育卡》递交部门安全主管',
    type: 0,
  },
  {
    code: 20,
    name: '负责工段内劳保统计发放工作。根据实际使用需要向部门安全主管申领劳保用品、修改岗位劳保配发标准，确保员工劳保及时发放到位，并指导、监督员工正确使用',
    type: 0,
  },
  {
    code: 21,
    name: '危险作业审批履行相关审批流程，及现场的安全管理',
    type: 0,
  },
  {
    code: 22,
    name: '所辖外包施工队伍安全资质拥有率100%，有安全责任要求的合同率达到100%',
    type: 0,
  },
  {
    code: 23,
    name: '重要危险源包保率100%',
    type: 0,
  },
]
